docs/mpt/data-structures.md
```mermaid
classDiagram
    class MerklePatriciaNode {
        <<sealed trait>>
        +digest: Hash
    }
    
    class Leaf {
        +remainingCompact: CompactNibblePath
        +dataDigest: Hash
        +digest: Hash
        +remaining: Seq[Nibble]
    }
    
    class Branch {
        +pathsInternal: Map[Byte, Node]
        +digest: Hash
        +paths: Map[Nibble, Node]
        +childCount: Int
    }
    
    class Extension {
        +sharedCompact: CompactNibblePath
        +child: Branch
        +digest: Hash
        +shared: Seq[Nibble]
    }
    
    MerklePatriciaNode <|-- Leaf
    MerklePatriciaNode <|-- Branch
    MerklePatriciaNode <|-- Extension
    Extension --> Branch : child
    Branch --> MerklePatriciaNode : children
```
